20240130T235419--kdoc-66-通知ビューワを作る__draft_memo.org
:properties:
:ID: 20240130T235419
:end:
#+title:      KDOC 66: 通知ビューワを作る
#+date:       [2024-01-30 Tue 23:54]
#+filetags:   :draft:memo:
#+identifier: 20240130T235419

* この文書のステータス
- [ ] 作成
- [ ] レビュー
* 概要
前代の通知ビューワは、iframeの制約とwebsocketが面倒で拡張しにくかった。Electronを使って新しく作る。

リポジトリ。

- [[https://github.com/kijimaD/squall][kijimaD/squall]]

* Tasks
** TODO タブが切り替わらないことがある
クリックしても変わらないことがある。
** TODO 既読を押しても、次読み込んだときに表示されることがある
既読できてないときがある。
** TODO 取得したエントリの一覧を出す
デバッグでも便利そうなので、一覧表示したい。
** TODO フィードソースの一覧を出す
何を読み込んでるか確認できるようにする。
** TODO 現在のURLを表示する
:LOGBOOK:
CLOCK: [2024-02-02 Fri 00:37]--[2024-02-02 Fri 01:02] =>  0:25
CLOCK: [2024-02-01 Thu 21:45]--[2024-02-01 Thu 22:11] =>  0:26
:END:
URLを表示する。
** TODO コピペできるようにする
コンテキストメニューが出ないのでコピペできない。
** TODO サーバと表示状態を関連させる(タブの削除が成功したときだけ、削除APIをリクエストするなど)
タイミングによるのか、どっちか失敗すると、同期がとれない。方式も検討する。
** TODO 統計をとる
統計をとって楽しく表示したい。
** TODO 前のページに戻れない
前のページへ戻れるようにする。
** TODO マウスオーバーで翻訳したい
Mouse Dictionaryを搭載したい。

Chromeのプラグインを入れられるのか。
** TODO デリバリーをかんたんにしたい
フロントとバックエンドをバラバラにインストールして起動する必要があるが、片方だけでよくしたい。どちらで吸収するのがよいだろうか。
** TODO 新しいタブで開いたときにサイドバーが隠れる
どうすればよい。
** TODO ソースはどこか表示する
RSSフィードのソースがどこか表示したい。
** TODO あとで読むを追加する
前提知識がないので後で読みたいときもある。

ユーザ定義のタグをつければいいか。
** TODO リロードできるようにする
リロードできないのでどうにかする。
** TODO タブが空白になるものがある
なぜか不明。バックエンドはちゃんとURLを返している。そのURLはほかと変わらない。
** TODO サイドバーが微妙に入りきってない
下が表示できてない。

* Archives
