20240130T235419--kdoc-66-通知ビューワを作る__draft_memo.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-06 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 66: 通知ビューワを作る</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 66: 通知ビューワを作る</h1>

<div id="outline-container-org3763e4d" class="outline-2">
<h2 id="org3763e4d"><a href="#org3763e4d">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org3763e4d">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> 作成</li>
<li class="off"><input type='checkbox' /> レビュー</li>
</ul>
</div>
</div>
<div id="outline-container-org4884b97" class="outline-2">
<h2 id="org4884b97"><a href="#org4884b97">概要</a></h2>
<div class="outline-text-2" id="text-org4884b97">
<p>
前代の通知ビューワは、iframeの制約とwebsocketが面倒で拡張しにくかった。Electronを使って新しく作る。
</p>

<p>
リポジトリ。
</p>

<ul class="org-ul">
<li><a href="https://github.com/kijimaD/squall">kijimaD/squall</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgacdbdc0" class="outline-2">
<h2 id="orgacdbdc0"><a href="#orgacdbdc0">Tasks</a></h2>
<div class="outline-text-2" id="text-orgacdbdc0">
</div>
<div id="outline-container-orgccbcc78" class="outline-3">
<h3 id="orgccbcc78"><a href="#orgccbcc78"><span class="todo TODO">TODO</span> タブが切り替わらないことがある</a></h3>
<div class="outline-text-3" id="text-orgccbcc78">
<p>
クリックしても変わらないことがある。
</p>
</div>
</div>
<div id="outline-container-org036ec40" class="outline-3">
<h3 id="org036ec40"><a href="#org036ec40"><span class="todo TODO">TODO</span> 既読を押しても、次読み込んだときに表示されることがある</a></h3>
<div class="outline-text-3" id="text-org036ec40">
<p>
既読できてないときがある。
</p>
</div>
</div>
<div id="outline-container-org0b84030" class="outline-3">
<h3 id="org0b84030"><a href="#org0b84030"><span class="todo TODO">TODO</span> 取得したエントリの一覧を出す</a></h3>
<div class="outline-text-3" id="text-org0b84030">
<p>
デバッグでも便利そうなので、一覧表示したい。
</p>
</div>
</div>
<div id="outline-container-orgbb2cc71" class="outline-3">
<h3 id="orgbb2cc71"><a href="#orgbb2cc71"><span class="todo TODO">TODO</span> フィードソースの一覧を出す</a></h3>
<div class="outline-text-3" id="text-orgbb2cc71">
<p>
何を読み込んでるか確認できるようにする。
</p>
</div>
</div>
<div id="outline-container-org2710548" class="outline-3">
<h3 id="org2710548"><a href="#org2710548"><span class="todo TODO">TODO</span> 現在のURLを表示する</a></h3>
<div class="outline-text-3" id="text-org2710548">
<p>
URLを表示する。
</p>
</div>
</div>
<div id="outline-container-org7e51d00" class="outline-3">
<h3 id="org7e51d00"><a href="#org7e51d00"><span class="todo TODO">TODO</span> コピペできるようにする</a></h3>
<div class="outline-text-3" id="text-org7e51d00">
<p>
コンテキストメニューが出ないのでコピペできない。
</p>
</div>
</div>
<div id="outline-container-org19988d2" class="outline-3">
<h3 id="org19988d2"><a href="#org19988d2"><span class="todo TODO">TODO</span> サーバと表示状態を関連させる(タブの削除が成功したときだけ、削除APIをリクエストするなど)</a></h3>
<div class="outline-text-3" id="text-org19988d2">
<p>
タイミングによるのか、どっちか失敗すると、同期がとれない。方式も検討する。
</p>
</div>
</div>
<div id="outline-container-orgc9a5fea" class="outline-3">
<h3 id="orgc9a5fea"><a href="#orgc9a5fea"><span class="todo TODO">TODO</span> 統計をとる</a></h3>
<div class="outline-text-3" id="text-orgc9a5fea">
<p>
統計をとって楽しく表示したい。
</p>
</div>
</div>
<div id="outline-container-orgfb9bfad" class="outline-3">
<h3 id="orgfb9bfad"><a href="#orgfb9bfad"><span class="todo TODO">TODO</span> 前のページに戻れない</a></h3>
<div class="outline-text-3" id="text-orgfb9bfad">
<p>
前のページへ戻れるようにする。
</p>
</div>
</div>
<div id="outline-container-orgca66c8b" class="outline-3">
<h3 id="orgca66c8b"><a href="#orgca66c8b"><span class="todo TODO">TODO</span> マウスオーバーで翻訳したい</a></h3>
<div class="outline-text-3" id="text-orgca66c8b">
<p>
Mouse Dictionaryを搭載したい。
</p>

<p>
Chromeのプラグインを入れられるのか。
</p>
</div>
</div>
<div id="outline-container-org1fc550c" class="outline-3">
<h3 id="org1fc550c"><a href="#org1fc550c"><span class="todo TODO">TODO</span> デリバリーをかんたんにしたい</a></h3>
<div class="outline-text-3" id="text-org1fc550c">
<p>
フロントとバックエンドをバラバラにインストールして起動する必要があるが、片方だけでよくしたい。どちらで吸収するのがよいだろうか。
</p>
</div>
</div>
<div id="outline-container-org193fbbc" class="outline-3">
<h3 id="org193fbbc"><a href="#org193fbbc"><span class="todo TODO">TODO</span> 新しいタブで開いたときにサイドバーが隠れる</a></h3>
<div class="outline-text-3" id="text-org193fbbc">
<p>
どうすればよい。
</p>
</div>
</div>
<div id="outline-container-orgfed9357" class="outline-3">
<h3 id="orgfed9357"><a href="#orgfed9357"><span class="todo TODO">TODO</span> ソースはどこか表示する</a></h3>
<div class="outline-text-3" id="text-orgfed9357">
<p>
RSSフィードのソースがどこか表示したい。
</p>
</div>
</div>
<div id="outline-container-orga289465" class="outline-3">
<h3 id="orga289465"><a href="#orga289465"><span class="todo TODO">TODO</span> あとで読むを追加する</a></h3>
<div class="outline-text-3" id="text-orga289465">
<p>
前提知識がないので後で読みたいときもある。
</p>

<p>
ユーザ定義のタグをつければいいか。
</p>
</div>
</div>
<div id="outline-container-org17be797" class="outline-3">
<h3 id="org17be797"><a href="#org17be797"><span class="todo TODO">TODO</span> リロードできるようにする</a></h3>
<div class="outline-text-3" id="text-org17be797">
<p>
リロードできないのでどうにかする。
</p>
</div>
</div>
<div id="outline-container-orgb35ff62" class="outline-3">
<h3 id="orgb35ff62"><a href="#orgb35ff62"><span class="todo TODO">TODO</span> タブが空白になるものがある</a></h3>
<div class="outline-text-3" id="text-orgb35ff62">
<p>
なぜか不明。バックエンドはちゃんとURLを返している。そのURLはほかと変わらない。
</p>
</div>
</div>
<div id="outline-container-orgab46eb9" class="outline-3">
<h3 id="orgab46eb9"><a href="#orgab46eb9"><span class="todo TODO">TODO</span> サイドバーが微妙に入りきってない</a></h3>
<div class="outline-text-3" id="text-orgab46eb9">
<p>
下が表示できてない。
</p>
</div>
</div>
</div>

<div id="outline-container-org6b408fc" class="outline-2">
<h2 id="org6b408fc"><a href="#org6b408fc">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
